In [1]:
import pandas as pd

In [3]:
df=pd.read_csv("placement - placement.csv")
df

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [4]:
df.head()

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1
4  7.52          7.30       1

In [5]:
df.tail()

    cgpa  resume_score  placed
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

In [6]:
df.sample()

    cgpa  resume_score  placed
32  5.87          7.96       0

In [8]:
df.describe()

           cgpa  resume_score      placed
count  100.0000    100.000000  100.000000
mean     6.9422      6.930500    0.500000
std      1.1192      0.979608    0.502519
min      5.2700      4.950000    0.000000
25%      5.9800      6.190000    0.000000
50%      6.6200      7.055000    0.500000
75%      8.0450      7.640000    1.000000
max      9.4000      9.060000    1.000000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cgpa          100 non-null    float64
 1   resume_score  100 non-null    float64
 2   placed        100 non-null    int64
dtypes: float64(2), int64(1)
memory usage: 2.5 KB

In [10]:
top_left_corner_df=df.iloc[:4,:3]##
top_left_corner_df

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1

In [11]:
df.loc[1:3,['cgpa','placed']]##slicing included both, row range and column name

   cgpa  placed
1  6.17       0
2  8.27       1
3  6.88       1

In [12]:
p=df.dtypes#gives the data types for each
p

cgpa            float64
resume_score    float64
placed            int64
dtype: object

In [13]:
b=df.empty#if there is any empty value gives true else false
b

False

In [14]:
df.isnull().sum()#for check missing values

cgpa            0
resume_score    0
placed          0
dtype: int64

In [15]:
df=df.dropna()#for remove missing row

In [16]:
i=df.ndim#number of axes(it is 2)
i

2

In [17]:
t=df.size#row count * column count
t

300

In [18]:
t=df.shape#shape=n(rows),n(columns)
t

(100, 3)

In [19]:
a=df.values #get a numpy array for df
a

array([[8.14, 6.52, 1.  ],
       [6.17, 5.17, 0.  ],
       [8.27, 8.86, 1.  ],
       [6.88, 7.27, 1.  ],
       [7.52, 7.3 , 1.  ],
       [8.77, 6.19, 1.  ],
       [5.34, 7.09, 0.  ],
       [6.56, 6.29, 0.  ],
       [6.32, 6.71, 0.  ],
       [7.69, 7.12, 1.  ],
       [6.18, 6.35, 0.  ],
       [5.44, 6.54, 0.  ],
       [6.09, 7.01, 0.  ],
       [8.5 , 5.09, 1.  ],
       [7.51, 6.25, 1.  ],
       [8.88, 5.93, 1.  ],
       [8.04, 7.64, 1.  ],
       [7.81, 8.71, 1.  ],
       [5.94, 5.88, 0.  ],
       [6.75, 8.11, 1.  ],
       [5.8 , 8.06, 0.  ],
       [6.53, 7.64, 0.  ],
       [6.16, 5.77, 0.  ],
       [6.05, 7.13, 0.  ],
       [8.22, 6.18, 1.  ],
       [7.76, 5.68, 1.  ],
       [6.27, 6.47, 0.  ],
       [5.51, 6.15, 0.  ],
       [7.46, 7.67, 1.  ],
       [6.19, 7.3 , 0.  ],
       [7.36, 7.15, 1.  ],
       [5.92, 7.02, 0.  ],
       [5.87, 7.96, 0.  ],
       [8.43, 7.73, 1.  ],
       [8.87, 7.19, 1.  ],
       [8.07, 7.48, 1.  ],
       [8.16, 7.56, 1.  ],
       [9.05, 8.21, 1.  ],
       [6.  , 8.72, 0.  ],
       [7.5 , 6.19, 1.  ],
       [8.25, 5.32, 1.  ],
       [8.68, 5.15, 1.  ],
       [6.9 , 6.91, 1.  ],
       [8.21, 7.95, 1.  ],
       [5.47, 5.92, 0.  ],
       [8.1 , 5.44, 1.  ],
       [5.83, 5.21, 0.  ],
       [7.05, 8.14, 1.  ],
       [5.54, 6.57, 0.  ],
       [5.46, 6.73, 0.  ],
       [8.22, 6.74, 1.  ],
       [6.54, 7.39, 0.  ],
       [5.9 , 7.5 , 0.  ],
       [6.  , 7.16, 0.  ],
       [5.92, 7.18, 0.  ],
       [6.94, 6.87, 1.  ],
       [6.13, 6.43, 0.  ],
       [6.34, 7.21, 0.  ],
       [6.47, 7.37, 0.  ],
       [5.95, 7.57, 0.  ],
       [5.87, 6.64, 0.  ],
       [6.89, 7.96, 1.  ],
       [5.75, 8.43, 0.  ],
       [8.65, 7.58, 1.  ],
       [7.93, 8.09, 1.  ],
       [6.04, 8.75, 0.  ],
       [8.35, 8.02, 1.  ],
       [6.59, 6.81, 1.  ],
       [6.01, 7.49, 0.  ],
       [8.06, 9.06, 1.  ],
       [7.12, 7.41, 1.  ],
       [7.34, 8.22, 1.  ],
       [7.63, 7.98, 1.  ],
       [5.76, 6.48, 0.  ],
       [5.54, 7.36, 0.  ],
       [6.34, 7.94, 1.  ],
       [9.4 , 5.5 , 1.  ],
       [5.88, 6.92, 0.  ],
       [5.79, 5.66, 0.  ],
       [5.27, 7.28, 0.  ],
       [7.83, 7.7 , 1.  ],
       [6.12, 6.72, 0.  ],
       [7.92, 6.06, 1.  ],
       [7.6 , 8.08, 1.  ],
       [5.76, 6.49, 0.  ],
       [6.72, 5.46, 0.  ],
       [6.18, 5.76, 0.  ],
       [5.62, 5.05, 0.  ],
       [8.07, 6.07, 1.  ],
       [5.99, 7.49, 0.  ],
       [5.85, 5.56, 0.  ],
       [8.28, 6.3 , 1.  ],
       [5.43, 6.18, 0.  ],
       [9.31, 7.39, 1.  ],
       [8.01, 4.95, 1.  ],
       [6.33, 6.38, 0.  ],
       [8.23, 7.76, 1.  ],
       [6.65, 7.78, 0.  ],
       [8.14, 5.63, 1.  ],
       [6.09, 6.61, 0.  ]])

In [20]:
df=df.copy()

In [21]:
p=df.sort_values(by='resume_score')#using a new variable doesnt make chasnges to the original one 
p

    cgpa  resume_score  placed
94  8.01          4.95       1
87  5.62          5.05       0
13  8.50          5.09       1
41  8.68          5.15       1
1   6.17          5.17       0
..   ...           ...     ...
17  7.81          8.71       1
38  6.00          8.72       0
65  6.04          8.75       0
2   8.27          8.86       1
69  8.06          9.06       1

[100 rows x 3 columns]

In [22]:
r=df.sort_index()
r

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [25]:
#x=df.astype(int) #type conversion
df['cgpa']=df['cgpa'].astype(int)

In [26]:
df['cgpa']

0     8
1     6
2     8
3     6
4     7
     ..
95    6
96    8
97    6
98    8
99    6
Name: cgpa, Length: 100, dtype: int64

In [30]:
#t=df.add(4)
t
df['cgpa']=df['cgpa'].add(4)
df['resume_score']=df['resume_score'].add(5)
df['places']=df['placed'].add(6)
df['cgpa']
df['resume_score']
df['places']

0     7
1     6
2     7
3     7
4     7
     ..
95    6
96    7
97    6
98    7
99    6
Name: places, Length: 100, dtype: int64

In [31]:
s=df.count()
s

cgpa            100
resume_score    100
placed          100
places          100
dtype: int64

In [32]:
p=df.max()
p

cgpa            21.00
resume_score    24.06
placed           1.00
places           7.00
dtype: float64

In [33]:
q=df.min()
q

cgpa            17.00
resume_score    19.95
placed           0.00
places           6.00
dtype: float64

In [34]:
#x=1,2,3,4,5
#mean=1+2+3+4+5=15/5=3
#x=1,2,3,4,5,100
#median=115/6=19.3

In [35]:
r=df['cgpa'].mean()
r

np.float64(18.47)

In [36]:
s=df['cgpa'].median()
s

np.float64(18.0)

In [37]:
df.mean()

cgpa            18.4700
resume_score    21.9305
placed           0.5000
places           6.5000
dtype: float64

In [38]:
g=df.filter(items=['cgpa','placed'])
g
df[['cgpa','placed']]#second option of filtering

    cgpa  placed
0     20       1
1     18       0
2     20       1
3     18       1
4     19       1
..   ...     ...
95    18       0
96    20       1
97    18       0
98    20       1
99    18       0

[100 rows x 2 columns]

In [40]:
s=df.filter(items=[5,6],axis=0)##axis=0 means row wise operation,bydfault its column wise and in numpy its opposite
s

   cgpa  resume_score  placed  places
5    20         21.19       1       7
6    17         22.09       0       6

In [41]:
s=df.to_dict()##her to_ means save to ##save in dictionary

In [42]:
q=df.to_string ##save in string

In [43]:
e=df.to_csv("path_location")

In [44]:
idx=df.columns
idx

Index(['cgpa', 'resume_score', 'placed', 'places'], dtype='object')

In [45]:
label=df.columns[0]#first column label
label

'cgpa'

In [46]:
p=df.columns.tolist()#list of column labels
p

['cgpa', 'resume_score', 'placed', 'places']

In [47]:
q=df.columns.values#array of column labels
q

array(['cgpa', 'resume_score', 'placed', 'places'], dtype=object)

In [48]:
p=df.rename(columns={'cgpa':'updated_cgpa',
                     'resume_score':'semester_marks'})#how to rename a column
p

    updated_cgpa  semester_marks  placed  places
0             20           21.52       1       7
1             18           20.17       0       6
2             20           23.86       1       7
3             18           22.27       1       7
4             19           22.30       1       7
..           ...             ...     ...     ...
95            18           21.38       0       6
96            20           22.76       1       7
97            18           22.78       0       6
98            20           20.63       1       7
99            18           21.61       0       6

[100 rows x 4 columns]

In [49]:
#case sensitive
#if mistakenly a word mismathched a new column will created
df['Cgpan']=df['cgpa'].astype(int)

In [50]:
a=df.drop(columns=['Cgpan','placed'])#to remove that unwanted column
a

    cgpa  resume_score  places
0     20         21.52       7
1     18         20.17       6
2     20         23.86       7
3     18         22.27       7
4     19         22.30       7
..   ...           ...     ...
95    18         21.38       6
96    20         22.76       7
97    18         22.78       6
98    20         20.63       7
99    18         21.61       6

[100 rows x 3 columns]

In [52]:
df['new']=df['cgpa'].where(df['cgpa']>6,other=0)#conditon based

In [53]:
df.sample(8)

    cgpa  resume_score  placed  places  Cgpan  new
61    18         22.96       1       7     18   18
88    20         21.07       1       7     20   20
64    19         23.09       1       7     19   19
68    18         22.49       0       6     18   18
84    17         21.49       0       6     17   17
37    21         23.21       1       7     21   21
44    17         20.92       0       6     17   17
46    17         20.21       0       6     17   17

In [54]:
#df merging,contenating notes

In [56]:
data1={
    "name":["Sally","Mary","John"],
    "age":[50,40,30]
}

data2={
    "name":["Sally","peter","Micky"],
    "age":[77,44,22]
}

df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)

newdf=df1.merge(df2,how='left')

In [57]:
newdf

    name  age
0  Sally   50
1   Mary   40
2   John   30

In [12]:
#define a dictinary containing employee data
data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

# Define a dictionary containing employee data
data2 = {'Name': ['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'],
         'Age': [17, 14, 12, 52],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Btech', 'B.hons','Mba','phd']}

In [7]:
import pandas as pd
#if data are different
#new_dt=pd.concat([data1,data2])
#new_dt

#if data is same 
df3=pd.DataFrame(data1)
df4=pd.DataFrame(data2)
df3

In [11]:
df3

NameError: name 'df3' is not defined